{
  "error": 0,
  "message": "Locations Fetched Successfully",
  "data": [
    {
      "id": 1,
      "name": "Mustang",
      "description": "Mustang is a remote and mystical region in Nepal, known for its ancient monasteries, rugged landscapes, and the famous Muktinath Temple, a sacred site for both Hindus and Buddhists. The region is divided into Lower Mustang and Upper Mustang, the latter requiring special permits to visit. Mustang's barren yet mesmerizing terrain, influenced by Tibetan culture, offers breathtaking views of the Himalayas and attracts adventurers, trekkers, and spiritual seekers alike.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 28.7833,
      "longitude": 83.7250,
      "image": ["https://media.istockphoto.com/id/483146188/photo/rural-life-in-front-of-incredible-himalayas.jpg?s=612x612&w=0&k=20&c=uyjMW6JoAz86tghJer7tAY6OyauPhlIIB__wUzYJeSA="],
      "created_at": "2025-02-08T06:40:00.000000Z",
      "popularity": "5.0"
    },
    {
      "id": 2,
      "name": "Pashupatinath",
      "description": "Pashupatinath Temple is one of the most sacred Hindu temples dedicated to Lord Shiva, located on the banks of the Bagmati River in Kathmandu, Nepal. It is a UNESCO World Heritage Site and a major pilgrimage destination for Hindus, especially during the Maha Shivaratri festival, when thousands of devotees from Nepal and India gather to offer prayers. The temple's pagoda-style architecture, with its golden roof and intricately carved silver doors, showcases Nepalese craftsmanship. Non-Hindus are not allowed inside the main temple, but they can view it from across the river. The temple complex also includes numerous smaller shrines, ashrams, and ghats (cremation sites), where traditional Hindu funeral rites are performed.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.6718,
      "longitude": 85.4285,
      "image": ["https://www.holidaystonepal.in/media/files/Blogs/Pashupatinath-Temple-Photos/Pashupatinath-Temple.png"],
      "created_at": "2025-02-08T06:41:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 3,
      "name": "Lumbini",
      "description": "Lumbini is the birthplace of Gautama Buddha, located in the Rupandehi District of Nepal. It is one of the holiest pilgrimage sites for Buddhists and a UNESCO World Heritage Site. Lumbini is believed to be the place where Queen Maya Devi gave birth to Siddhartha Gautama in 623 BCE, who later became the Buddha and founded Buddhism. The site features the Maya Devi Temple, which enshrines ancient ruins and a marker stone indicating Buddha’s exact birthplace. Nearby, the Ashoka Pillar, erected by Emperor Ashoka of India in the 3rd century BCE, stands as historical evidence of the site's significance. The area also includes various monasteries built by Buddhist communities from different countries, symbolizing global reverence for the Buddha’s teachings.",
      "destination_type": "Local",
      "location": "Lumbini Province",
      "latitude": 27.6792,
      "longitude": 83.5070,
      "image": ["https://lumbinidevtrust.gov.np/upload_file/images/slider/1721894939_276597348_lumbini.jpg"],
      "created_at": "2025-02-08T06:42:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 4,
      "name": "Kalinchowk",
      "description": "Kalinchowk is a popular pilgrimage and trekking destination in Nepal, known for the Kalinchowk Bhagwati Temple, situated at an altitude of 3,842 meters. The temple, dedicated to Goddess Kali, offers panoramic views of the Himalayas, including Everest, Langtang, and Gaurishankar ranges. During winter, Kalinchowk transforms into a snowy paradise, attracting visitors for snowfall and cable car rides. It is also a gateway to the Rolwaling region, offering adventurous trekking experiences.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.6667,
      "longitude": 86.0000,
      "image": ["https://media.istockphoto.com/id/1690228774/photo/view-of-the-beautiful-kuri-village-of-kalinchowk-nepal-from-the-top-of-a-mountain-with-the.jpg?s=612x612&w=0&k=20&c=2PUcW1Wasve5XvOxf85r9MOqtg8dziUeaBa5vMfna5s="],
      "created_at": "2025-02-08T06:43:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 5,
      "name": "Pokhara",
      "description": "Pokhara, the tourism capital of Nepal, is a picturesque city known for its serene lakes, adventure sports, and breathtaking mountain views. It serves as the gateway to the Annapurna trekking region and offers activities such as paragliding, boating on Phewa Lake, and exploring caves and waterfalls. The city is also home to cultural sites like the Tal Barahi Temple, Bindhyabasini Temple, and the Peace Pagoda. Pokhara’s vibrant lakeside area is a favorite among tourists for its restaurants, nightlife, and relaxing atmosphere.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 28.2096,
      "longitude": 83.9856,
      "image": ["https://media.istockphoto.com/id/687611810/photo/view-at-annapurna-mountain-range-and-its-reflection-in-phewa-lake-in-pokhara-nepal.jpg?s=612x612&w=0&k=20&c=r1uza8OoSQeGGTrnnaHyq7HSxHG9DyvjHxxm4vqgDsc="],
      "created_at": "2025-02-08T06:44:00.000000Z",
      "popularity": "5.0"
    },
    {
      "id": 6,
      "name": "Manakamana",
      "description": "Manakamana Temple, located in the Gorkha District, is a revered Hindu temple dedicated to the Goddess Bhagwati. The temple is believed to fulfill the wishes of devotees and is accessible via a scenic cable car ride from Kurintar. The temple’s history dates back to the 17th century, and it attracts thousands of pilgrims annually. The journey offers stunning views of lush hills, the Trishuli River, and distant snow-capped peaks.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 27.9320,
      "longitude": 84.6267,
      "image": ["https://media.istockphoto.com/id/1478302417/photo/manakamana-mai-temple-nepali-architecture-tradition-in-kalupande-hills-indrasthan-kathmandu.jpg?s=612x612&w=0&k=20&c=F5Wd8FpkffUi7ldallcwMlT0Dm2OG-84rTKjw2D4eHg="],
      "created_at": "2025-02-08T06:45:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 7,
      "name": "Janakpur Temple",
      "description": "Janaki Temple, located in Janakpur, is a grand Hindu temple dedicated to Goddess Sita, the consort of Lord Rama. The temple is a significant pilgrimage site for Hindus and a masterpiece of Rajput and Mughal architecture. Janakpur is believed to be the birthplace of Sita and the venue of her marriage to Rama. The temple’s vibrant celebrations during festivals like Ram Navami and Vivah Panchami attract thousands of devotees from Nepal and India.",
      "destination_type": "Local",
      "location": "Madhesh Province",
      "latitude": 26.7324,
      "longitude": 85.9250,
      "image": ["https://media.istockphoto.com/id/1349580486/photo/janaki-hindu-temple-in-janakpur-nepal.jpg?s=612x612&w=0&k=20&c=bvWcpGRAxm-pDoUHRTkGj5xfyowoixL45R7yHT5LCBk="],
      "created_at": "2025-02-08T06:46:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 8,
      "name": "Chitwan National Park",
      "description": "Chitwan National Park, Nepal's first national park, is a UNESCO World Heritage Site known for its rich biodiversity. It is home to endangered species like the Bengal tiger, one-horned rhinoceros, and gharial crocodile. Visitors can enjoy jungle safaris, elephant rides, bird watching, and canoeing. The park also offers cultural experiences with the Tharu community, known for their traditional dance and lifestyle.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.5000,
      "longitude": 84.3333,
      "image": ["https://chitwannationalpark.gov.np/images/2024/05/24/1.jpg"],
      "created_at": "2025-02-08T06:47:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 9,
      "name": "Swayambhunath",
      "description": "Swayambhunath, also known as the Monkey Temple, is an ancient religious complex atop a hill in Kathmandu. It is one of the oldest and most sacred Buddhist sites in Nepal, featuring a stupa adorned with the all-seeing eyes of Buddha. The site is a blend of Hindu and Buddhist traditions and offers panoramic views of Kathmandu Valley. It is a popular pilgrimage site and a symbol of peace and harmony.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.7149,
      "longitude": 85.2905,
      "image": ["https://www.holidaystonepal.in/media/files/Blogs/SwayambhunathStupa/swayambhunath-stupa.png"],
      "created_at": "2025-02-08T06:48:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 10,
      "name": "Bhaktapur Durbar Square",
      "description": "Bhaktapur Durbar Square, a UNESCO World Heritage Site, is a historic square in Bhaktapur city. It is renowned for its well-preserved medieval architecture, including the 55-Window Palace, Nyatapola Temple, and Golden Gate. The square reflects the rich cultural heritage of the Newar community and is a hub for traditional arts and crafts.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.6710,
      "longitude": 85.4295,
      "image": ["https://www.encountersnepal.com/assets/images/tour-in-nepal/day-tour-in-nepal/bhaktapur.jpg"],
      "created_at": "2025-02-08T06:49:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 11,
      "name": "Langtang Valley",
      "description": "Langtang Valley, located north of Kathmandu, is a serene Himalayan valley known for its stunning landscapes, diverse flora and fauna, and rich Tamang culture. The Langtang National Park offers trekking opportunities with views of Langtang Lirung, Ganesh Himal, and other peaks. The valley is also home to the sacred Gosainkunda Lake, a pilgrimage site for Hindus.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 28.2000,
      "longitude": 85.5000,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Kyanjin_Gompa_from_Kyanjin_Ri%2C_Langtang.jpg/1200px-Kyanjin_Gompa_from_Kyanjin_Ri%2C_Langtang.jpg"],
      "created_at": "2025-02-08T06:50:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 12,
      "name": "Rara Lake",
      "description": "Rara Lake, located in the remote Karnali Province, is the largest lake in Nepal. Surrounded by lush forests and snow-capped mountains, it is a pristine destination for nature lovers. The Rara National Park, home to rare wildlife like the red panda and musk deer, adds to the area's allure. The lake's crystal-clear waters and tranquil environment make it a perfect getaway.",
      "destination_type": "Local",
      "location": "Karnali Province",
      "latitude": 29.5200,
      "longitude": 82.0800,
      "image": ["https://www.pexels.com/photo/a-lake-surrounded-with-green-trees-near-mountains-13237958/"],
      "created_at": "2025-02-08T06:51:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 13,
      "name": "Tilicho Lake",
      "description": "Tilicho Lake, one of the highest lakes in the world, is located in the Manang District. It is a popular stop for trekkers on the Annapurna Circuit and offers breathtaking views of the surrounding Himalayas. The lake's turquoise waters and remote location make it a must-visit destination for adventure enthusiasts.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 28.6833,
      "longitude": 83.8500,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Peak_Tilicho_and_Lake_Tilicho.jpg/1200px-Peak_Tilicho_and_Lake_Tilicho.jpg"],
      "created_at": "2025-02-08T06:52:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 14,
      "name": "Ilam",
      "description": "Ilam, located in eastern Nepal, is famous for its tea gardens, lush hills, and serene environment. Known as the 'Tea Garden of Nepal,' it offers stunning views of the Himalayas and is a popular destination for nature walks and cultural experiences. The Mai Pokhari Lake and Antu Danda are key attractions.",
      "destination_type": "Local",
      "location": "Province 1",
      "latitude": 26.9000,
      "longitude": 87.9167,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/b/b8/Ilam_green.jpg"],
      "created_at": "2025-02-08T06:53:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 15,
      "name": "Gosaikunda",
      "description": "Gosaikunda, a sacred alpine lake in the Langtang region, is a major pilgrimage site for Hindus. It is believed to have been created by Lord Shiva and is surrounded by stunning mountain scenery. The lake is a key destination for trekkers and spiritual seekers.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 28.0833,
      "longitude": 85.4167,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/3/3a/The_Holy_Gosainkunda_Lake_during_the_winter._%28By_Saroj_Pandey%29.jpg"],
      "created_at": "2025-02-08T06:54:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 16,
      "name": "Bardia National Park",
      "description": "Bardia National Park, located in western Nepal, is the largest and most undisturbed national park in the Terai region. It is home to endangered species like the Bengal tiger, one-horned rhinoceros, and wild elephants. The park offers jungle safaris, bird watching, and cultural experiences with the Tharu community.",
      "destination_type": "Local",
      "location": "Lumbini Province",
      "latitude": 28.3833,
      "longitude": 81.4500,
      "image": ["https://tigerencounter.com/wp-content/uploads/2019/11/Bardia-National-Park.jpg"],
      "created_at": "2025-02-08T06:55:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 17,
      "name": "Khaptad National Park",
      "description": "Khaptad National Park, located in the Far-Western region, is known for its diverse flora and fauna, alpine meadows, and religious significance. The park is home to the Khaptad Baba Ashram, a spiritual retreat, and offers trekking opportunities with panoramic views of the Himalayas.",
      "destination_type": "Local",
      "location": "Sudurpashchim Province",
      "latitude": 29.2833,
      "longitude": 81.0833,
      "image": ["https://www.sabbaticalexplorenepal.com/cs1/wp-content/uploads/2024/04/Khaptad-National-Park-Trek-2-1.jpg"],
      "created_at": "2025-02-08T06:56:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 18,
      "name": "Shey Phoksundo Lake",
      "description": "Shey Phoksundo Lake, located in Dolpa District, is Nepal's deepest lake and a major attraction in the Shey Phoksundo National Park. The lake's turquoise waters and surrounding rugged terrain make it a stunning destination for trekkers and nature enthusiasts.",
      "destination_type": "Local",
      "location": "Karnali Province",
      "latitude": 29.2000,
      "longitude": 82.9500,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Shey-Phoksundo_lake.jpg/2560px-Shey-Phoksundo_lake.jpg"],
      "created_at": "2025-02-08T06:57:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 19,
      "name": "Muktinath",
      "description": "Muktinath, located in Mustang District, is a sacred site for both Hindus and Buddhists. The temple complex is dedicated to Lord Vishnu and is known for its 108 water spouts and eternal flame. It is a key pilgrimage site and a popular stop for trekkers on the Annapurna Circuit.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 28.8167,
      "longitude": 83.8667,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/6/69/The_Muktinath_Temple.jpg"],
      "created_at": "2025-02-08T06:58:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 20,
      "name": "Tansen",
      "description": "Tansen, a historic town in Palpa District, is known for its Newari architecture, cobbled streets, and panoramic views of the Himalayas. The town is a cultural hub and offers attractions like Srinagar Danda, Tansen Durbar, and Rani Mahal.",
      "destination_type": "Local",
      "location": "Lumbini Province",
      "latitude": 27.8667,
      "longitude": 83.5500,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/9/9c/Tansen%2C_Palpa%2C_Nepal.jpg"],
      "created_at": "2025-02-08T06:59:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 21,
      "name": "Halesi Mahadev",
      "description": "Halesi Mahadev, located in Khotang District, is a sacred cave temple dedicated to Lord Shiva. It is believed to be the place where Lord Shiva hid from the demon Bhasmasur. The temple is a major pilgrimage site for Hindus and Buddhists.",
      "destination_type": "Local",
      "location": "Province 1",
      "latitude": 27.2500,
      "longitude": 86.5833,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Maratika_cave_1.jpg/1200px-Maratika_cave_1.jpg"],
      "created_at": "2025-02-08T07:00:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 22,
      "name": "Namche Bazaar",
      "description": "Namche Bazaar, a bustling town in the Khumbu region, is the gateway to Everest Base Camp. It is a hub for trekkers and climbers, offering acclimatization stops, markets, and stunning views of Everest and surrounding peaks.",
      "destination_type": "Local",
      "location": "Province 1",
      "latitude": 27.8000,
      "longitude": 86.7167,
      "image": ["https://admin.ntb.gov.np/image-cache/namche-1624441294.jpeg?p=main&s=b0de17e177d5ada3dea3c35430525801"],
      "created_at": "2025-02-08T07:01:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 23,
      "name": "Dolpa",
      "description": "Dolpa, a remote district in western Nepal, is known for its rugged landscapes, ancient monasteries, and unique culture. The region is home to Shey Phoksundo Lake and the Phoksundo National Park, offering trekking opportunities and a glimpse into the traditional Tibetan way of life.",
      "destination_type": "Local",
      "location": "Karnali Province",
      "latitude": 29.1667,
      "longitude": 82.9167,
      "image": ["https://www.nestadventure.com/wp-content/uploads/2019/08/Upper-Dolpa-Trek.jpg"],
      "created_at": "2025-02-08T07:02:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 24,
      "name": "Gorkha",
      "description": "Gorkha, the birthplace of King Prithvi Narayan Shah, is a historic town in central Nepal. It is home to the Gorkha Durbar, a hilltop palace with stunning views of the Himalayas, and the Manakamana Temple, a popular pilgrimage site.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 28.0000,
      "longitude": 84.6333,
      "image": ["https://nepaltraveller.com/images/main/1682496273.sidetrackimageimage_750x_61facb75a279b.jpg"],
      "created_at": "2025-02-08T07:03:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 25,
      "name": "Dharan",
      "description": "Dharan, a vibrant city in eastern Nepal, is known for its cultural diversity, lush greenery, and proximity to the Himalayas. It serves as a gateway to the Barah Chhetra pilgrimage site and offers attractions like the Pindeshwor Temple and Budha Subba Temple.",
      "destination_type": "Local",
      "location": "Province 1",
      "latitude": 26.8167,
      "longitude": 87.2833,
      "image": ["https://assets-cdn.kathmandupost.com/uploads/source/news/2019/miscellaneous/shutterstock_1170328435.jpg"],
      "created_at": "2025-02-08T07:04:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 26,
      "name": "Bandipur",
      "description": "Bandipur, a picturesque hilltop town, is known for its preserved Newari architecture, stunning views of the Himalayas, and serene environment. It offers a blend of cultural heritage and natural beauty, making it a popular destination for tourists.",
      "destination_type": "Local",
      "location": "Gandaki Province",
      "latitude": 27.9333,
      "longitude": 84.4167,
      "image": ["https://media.istockphoto.com/id/1321462048/photo/one-horned-rhinoceros-in-chitwan-national-park-nepal.jpg?s=612x612&w=0&k=20&c=Z4XJZ7Z4XJZ7Z4XJZ7Z4XJZ7Z4XJZ7Z4XJZ7Z4XJZ7Z4="],
      "created_at": "2025-02-08T07:05:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 27,
      "name": "Nagarkot",
      "description": "Nagarkot, a hill station near Kathmandu, is famous for its panoramic views of the Himalayas, including Mount Everest. It is a popular destination for sunrise and sunset views, hiking, and relaxation.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.7167,
      "longitude": 85.5167,
      "image": ["https://media.sublimetrails.com/uploads/img/untitled-design--40-.webp"],
      "created_at": "2025-02-08T07:06:00.000000Z",
      "popularity": "4.5"
    },
    {
      "id": 28,
      "name": "Dhulikhel",
      "description": "Dhulikhel, a scenic town in the Kathmandu Valley, is known for its stunning views of the Himalayas, ancient temples, and cultural heritage. It is a popular destination for hiking, meditation, and yoga retreats.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.6167,
      "longitude": 85.5500,
      "image": ["https://www.nepalhikinghimalaya.com/wp-content/uploads/2021/03/dhulikhel.jpg"],
      "created_at": "2025-02-08T07:07:00.000000Z",
      "popularity": "4.0"
    },
    {
      "id": 29,
      "name": "Kirtipur",
      "description": "Kirtipur, a historic town near Kathmandu, is known for its ancient temples, traditional Newari culture, and panoramic views of the Kathmandu Valley. It is a peaceful destination for cultural exploration and sightseeing.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.6667,
      "longitude": 85.2833,
      "image": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Bagh_Bhairab_Kritipur_IMG_8037_03.jpg/700px-Bagh_Bhairab_Kritipur_IMG_8037_03.jpg"],
      "created_at": "2025-02-08T07:08:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 30,
      "name": "Panauti",
      "description": "Panauti, a historic town in the Kathmandu Valley, is known for its ancient temples, traditional Newari architecture, and cultural festivals. It is a peaceful destination for cultural exploration and relaxation.",
      "destination_type": "Local",
      "location": "Bagmati Province",
      "latitude": 27.5833,
      "longitude": 85.5167,
      "image": ["https://assets-api.kathmandupost.com/thumb.php?src=https://assets-cdn.kathmandupost.com/uploads/source/news/2019/miscellaneous/Prasant_Shrestha.jpg&w=900&height=601"],
      "created_at": "2025-02-08T07:09:00.000000Z",
      "popularity": "3.5"
    },
    {
      "id": 31,
      "name": "Bhedetar",
      "description": "Bhedetar, a hill station in eastern Nepal, is known for its cool climate, stunning views of the Himalayas, and serene environment. It is a popular destination for picnics, hiking, and relaxation.",
      "destination_type": "Local",
      "location": "Province 1",
      "latitude": 26.8167,
      "longitude": 87.2833,
      "image": ["https://english.onlinekhabar.com/wp-content/uploads/2016/05/vedetar-pic.jpg"],
      "created_at": "2025-02-08T07:10:00.000000Z",
      "popularity": "3.5"
    }
  ]
}